app/Controllers/Arsip.php

SELECT *
FROM `arsip`
---
    public function index()
    {
        $roles = user()->getRoles();

        $role = in_array('admin', $roles) ? 'admin' : '';

        $fullname = user()->fullname;

        if ($role === 'admin') {
            $arsip = $this->arsipModel->findAll();