app/Controllers/Surat.php

    public function SKTM(): string
    {
        $builder = $this->db->table('users');
        $builder->select('id, jabatan');
        $query = $builder->get();
---
SELECT `id`, `jabatan`
FROM `users`