app/Controllers/User.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `arsip`
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `penginput` = 'Teguh Mulya'
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `tipe_surat` = 'Surat Masuk'
SELECT COUNT(*) AS `numrows`
FROM `arsip`
WHERE `tipe_surat` = 'Surat Keluar'
---
    public function index(): string
    {
        if (!logged_in()) {
            return redirect()->to('/login');
        }

        $userId = user_id();

        $loginActivityModel = new LoginActivityModel();
        $arsipModel = new ArsipModel();
        $userModel = new \Myth\Auth\Models\UserModel();

        $data['loginActivities'] = $loginActivityModel->where('user_id', $userId)->findAll();

        $data['totalUsers'] = $userModel->countAllResults();

        $data['totalArsip'] = $arsipModel->countAllResults();

        $data['arsipByUser'] = $arsipModel->where('penginput', user()->fullname)->countAllResults();

        $data['suratMasuk'] = $arsipModel->where('tipe_surat', 'Surat Masuk')->countAllResults();
        $data['suratKeluar'] = $arsipModel->where('tipe_surat', 'Surat Keluar')->countAllResults();